{"class_name": "Sequential", "keras_version": "2.0.5", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "conv2d_1", "activity_regularizer": null, "use_bias": true, "activation": "relu", "dtype": "float32", "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "batch_input_shape": [null, 32, 32, 3], "filters": 48, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [2, 2], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 32, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "kernel_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 16, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "kernel_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 5, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null}}], "backend": "tensorflow"}