{"config": [{"config": {"dtype": "float32", "trainable": true, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 32, "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_9", "batch_input_shape": [null, 32, 32, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "trainable": true, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 32, "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_10", "batch_input_shape": [null, 32, 32, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_5", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_5"}, "class_name": "Flatten"}, {"config": {"trainable": true, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_6", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_7", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential"}