{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "activation": "relu", "bias_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 32, 32, 3], "use_bias": true, "kernel_size": [2, 2], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "strides": [1, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "activation": "relu", "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_size": [2, 2], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "activation": "relu", "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_size": [2, 2], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "units": 5, "kernel_constraint": null}}], "keras_version": "2.0.5"}