{"config": [{"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "name": "conv2d_1", "dtype": "float32", "strides": [1, 1], "bias_regularizer": null, "filters": 48, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3], "padding": "valid", "kernel_size": [2, 2], "activity_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "name": "conv2d_2", "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_size": [2, 2], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "name": "conv2d_3", "bias_constraint": null, "use_bias": true, "filters": 16, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_size": [2, 2], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "units": 5, "name": "dense_1", "bias_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}