{"class_name": "Model", "keras_version": "2.0.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_17", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_17", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 64, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block1_conv1", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 64, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block1_conv2", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"padding": "valid", "name": "block1_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 128, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block2_conv1", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 128, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block2_conv2", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"padding": "valid", "name": "block2_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 256, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block3_conv1", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 256, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block3_conv2", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 256, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block3_conv3", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"padding": "valid", "name": "block3_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 512, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block4_conv1", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 512, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block4_conv2", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 512, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block4_conv3", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"padding": "valid", "name": "block4_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 512, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block5_conv1", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 512, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block5_conv2", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "relu", "filters": 512, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "name": "block5_conv3", "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"padding": "valid", "name": "block5_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_5", "config": {"padding": "valid", "name": "max_pooling2d_5", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_5", "config": {"name": "flatten_5", "trainable": true}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"kernel_regularizer": null, "name": "predictions", "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 5, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}], "input_layers": [["input_17", 0, 0]], "name": "model_4", "output_layers": [["predictions", 0, 0]]}, "backend": "tensorflow"}