{"config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "filters": 32, "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "padding": "valid", "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 1024, "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 10, "use_bias": true}}], "keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential"}